Revit 2027 API
BuiltInFailures.DisplacementElementFailures Class
 Error messages related to the DisplacementElement.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DisplacementElementFailures
Public NotInheritable Class DisplacementElementFailures
public ref class DisplacementElementFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DisplacementElementFailures = class end
The BuiltInFailures.DisplacementElementFailures type exposes the following members.
Properties
Name | Description
CannotCopyDisplacementSetIntoOtherDocument |  A Displacement Set can only be pasted into a view in the same document in which it was created.
CannotRemoveLastDisplacedElement |  A Displacement Set can only be pasted into a view in the same document in which it was created.
DetectedCycleInDisplacedElementParents |  Invalid parent relationship for a Displacement element. No cycles are allowed.
ElementsAlreadyDisplacedInView |  You cannot copy a displacement set into a view if one or several of its elements already belong to another displacement set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace